Revit 2027 API
Edge.IsFlippedOnFace(Int32) Method
Determines if this edge's topological direction on the Face is opposite to its parametric direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFlippedOnFace(
	int index
)
Public Function IsFlippedOnFace (
	index As Integer
) As Boolean
public:
bool IsFlippedOnFace(
	int index
)
member IsFlippedOnFace :
        index : int -> bool
Parameters
index Int32
The index of the face (0 or 1).
Return Value
Boolean
true if this edge's topological direction on the Face is opposite to its parametric direction, false if the topological direction agrees with the parametric direction.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the specified index is not 0 or 1.
Remarks
Outer edge loops on a Face are oriented counter-clockwise with respect to the Face's orientation, and inner loops are oriented clockwise. The topological direction of an edge on a face means the direction in which the edge's loop is being traversed.
See Also
Reference
Edge Class
IsFlippedOnFace Overload
Autodesk.Revit.DB Namespace